Revit 2027 API
PulldownButton.AddPushButton Method
Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PushButton AddPushButton(
	PushButtonData buttonData
)
Public Function AddPushButton (
	buttonData As PushButtonData
) As PushButton
public:
PushButton^ AddPushButton(
	PushButtonData^ buttonData
)
member AddPushButton :
        buttonData : PushButtonData -> PushButton
Parameters
buttonData PushButtonData
An object containing the data needed to construct the pushbutton.
Return Value
PushButton
 The newly added pushbutton.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when buttonData is null.
ArgumentException |  Thrown when button with buttonData.Name already exists in the button.
Remarks
 The new button will display its large image if PushButton.LargeImage is set.
See Also
Reference
PulldownButton Class
Autodesk.Revit.UI Namespace